fun main() {
    val nums = arrayOf(1, 2, 3, 4, 5, 6, 7, 7, 8, 9, 10, 11, 12, 13, 14, 15 ,16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45,46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100)
    val sum = nums.sum()//сумма массива
    val n = 100
    val array = IntArray(n) { it + 1 }
    val _sum = array.sum()//сумма чисел от 1 до 100
    val result = sum - _sum //вычетание суммы чисел от 1 до 100 из суммы массива для определения дубл элемента
    println("The array sum is $sum")
    println("the sum of the numbers from 1 to 100 is $_sum")
    println("the desired duplicate element is $result")
}

